tap "alvinunreal/tmuxai"
tap "ascii-draw/ascii-tree"
tap "charmbracelet/tap"
tap "fluxcd/tap"
tap "jandedobbeleer/oh-my-posh"
tap "opencode-ai/tap"
tap "peak/tap"
tap "warrensbox/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Code searching, linting, rewriting
brew "ast-grep"
# Shell extension to jump to frequently used directories
brew "autojump"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# GNU File, Shell, and Text utilities
brew "coreutils"
# USB programmer
brew "dfu-util"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Free lossless audio codec
brew "flac"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Native sequence editor for Git interactive rebase
brew "git-interactive-rebase-tool"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# CLI client for interacting with Incus
brew "incus"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Cloud-based, distributed POSIX file system built on top of Redis and S3
brew "juicefs"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# High-performance authoritative-only DNS server
brew "knot"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Run multiple commands in parallel
brew "mprocs"
# Audio time stretcher tool and library
brew "rubberband"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Python version management
brew "pyenv"
# Fast static code analyzer & language server for Python
brew "pylyzer"
# Static type checker for Python
brew "pyright"
# Persistent key-value database, with built-in net interface
brew "redis"
# Fast, efficient and secure backup program
brew "restic"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Work with remote images registries
brew "skopeo"
# SOund eXchange: universal sound sample translator
brew "sox"
# Minimal, customizable and neofetch-like weather CLI based on rainy
brew "stormy"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Lightweight BitTorrent client
brew "transmission-cli"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# CSV CLI magician written in Rust
brew "xan"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# AI-Powered, Non-Intrusive Terminal Assistant
brew "alvinunreal/tmuxai/tmuxai"
# Flux CLI
brew "fluxcd/tap/flux"
# Parallel S3 and local filesystem execution tool
brew "peak/tap/s5cmd"
# The tfswitch command lets you switch between terraform versions.
brew "warrensbox/tap/tfswitch"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli@beta"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Anthropic's official Claude AI desktop app
cask "claude"
# Create and run Linux containers using lightweight virtual machines
cask "container"
cask "font-commit-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-victor-mono-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "albert.tabout"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "bahramjoharshamshiri.hcl-lsp"
vscode "docker.docker"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jbockle.jbockle-format-files"
vscode "jmmeessen.jenkins-declarative-support"
vscode "mariorodeghiero.vue-theme"
vscode "miguelsolorio.fluent-icons"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pylyzer.pylyzer"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "ryu1kn.partial-diff"
vscode "teabyii.ayu"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "tomrijndorp.find-it-faster"
vscode "tyriar.sort-lines"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "zhangxiaoqian.emoji-intellisense"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/opencode-ai/opencode"
go "golang.org/x/website/tour"
